Revit 2027 API
NumberingSchema.AddPartitioningParameter Method
 Add a parameter to be used for partitioning elements in this schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddPartitioningParameter(
	NumberingParameter partitioningParameter
)
Public Sub AddPartitioningParameter (
	partitioningParameter As NumberingParameter
)
public:
void AddPartitioningParameter(
	NumberingParameter^ partitioningParameter
)
member AddPartitioningParameter :
        partitioningParameter : NumberingParameter -> unit
Parameters
partitioningParameter NumberingParameter
 Parameter to add for partitioning elements in this schema.
Exceptions
Exception | Condition
ArgumentException |  The input parameter is not valid for use in partitioning for numbering.
ArgumentNullException |  A non-optional argument was null
Remarks
 This method makes sure that the document will be consistent when it comes to numbering before it exits.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace